app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "prod"], ["price", 29.0], ["created_at", "2019-03-26 16:16:45.744910"], ["updated_at", "2019-03-26 16:16:45.744910"], ["user_id", 2]]
---
  def create
    @product = Product.new(product_params)
    @product.user = current_user
    if @product.save